tap "epk/epk"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "teamookla/speedtest"
brew "archey"
brew "bat"
brew "clang-format"
brew "cmake"
brew "diff-pdf"
brew "difftastic"
brew "duf"
brew "erdtree"
brew "erlang"
brew "exa"
brew "fd"
brew "gcc"
brew "gh"
brew "python@3.9"
brew "ghc"
brew "gpatch"
brew "helix"
brew "htop"
brew "hugo"
brew "ipython"
brew "jq"
brew "lf"
brew "libomp", link: true
brew "llvm@14"
brew "loc"
brew "luarocks"
brew "micro"
brew "ncdu"
brew "neovim"
brew "nmap"
brew "opam"
brew "open-mpi"
brew "openjdk@11"
brew "pdfgrep"
brew "peco"
brew "postgresql@14"
brew "python@3.10"
brew "ranger"
brew "redis"
brew "ripgrep"
brew "scc"
brew "shellcheck"
brew "swiftformat"
brew "swiftlint"
brew "terminal-notifier"
brew "tldr"
brew "tmux"
brew "trash"
brew "tree"
brew "ugit"
brew "wget"
brew "zig"
brew "zsh"
brew "teamookla/speedtest/speedtest"
cask "basictex"
cask "db-browser-for-sqlite"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-fira-mono"
cask "font-fira-mono-nerd-font"
cask "font-jetbrains-mono"
cask "font-sf-mono-nerd-font"
cask "iina"
cask "iterm2"
cask "notunes"
cask "openinterminal"
cask "raycast"
cask "rectangle"
cask "swimat"
cask "syntax-highlight"
