tap "bearer/tap"
tap "epk/epk"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/command-not-found"
tap "homebrew/services"
tap "snyk/tap"
tap "teamookla/speedtest"
brew "antidote"
brew "archey"
brew "autoconf"
brew "automake"
brew "bat"
brew "bat-extras"
brew "btop"
brew "cabextract"
brew "clang-format"
brew "cloc"
brew "cmake"
brew "cmake-docs"
brew "cppcheck"
brew "gmp"
brew "poppler"
brew "diff-pdf"
brew "difftastic"
brew "duf"
brew "erdtree"
brew "eza"
brew "fd"
brew "zeromq"
brew "ffmpeg"
brew "fontforge"
brew "fx"
brew "gcc"
brew "gflags"
brew "gh"
brew "ghc"
brew "git"
brew "gnu-getopt"
brew "gnu-tar"
brew "golangci-lint"
brew "gpatch"
brew "graphviz"
brew "helix"
brew "htop"
brew "hugo"
brew "ipython"
brew "jdtls"
brew "jq"
brew "lcdf-typetools"
brew "lf"
brew "libmagic"
brew "libomp", link: true
brew "llvm"
brew "llvm@14"
brew "llvm@16"
brew "loc"
brew "lsd"
brew "luarocks"
brew "make"
brew "micro"
brew "ncdu"
brew "neofetch"
brew "neovim"
brew "nmap"
brew "opam"
brew "open-mpi"
brew "openblas"
brew "openjdk@11"
brew "pdfgrep"
brew "peco"
brew "plplot"
brew "pocsuite3"
brew "postgresql@14"
brew "tcl-tk"
brew "python-tk@3.12"
brew "python@3.10"
brew "python@3.9"
brew "ranger"
brew "redis"
brew "ripgrep"
brew "scc"
brew "shellcheck"
brew "socat"
brew "starship"
brew "swiftformat"
brew "swiftlint"
brew "terminal-notifier"
brew "tldr"
brew "tmux"
brew "trash", link: true
brew "tree"
brew "ugit"
brew "wget"
brew "yazi"
brew "z"
brew "zig"
brew "zlib"
brew "zsh"
brew "teamookla/speedtest/speedtest"
cask "basictex"
cask "db-browser-for-sqlite"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-fira-mono"
cask "font-fira-mono-nerd-font"
cask "font-jetbrains-mono"
cask "font-martian-mono-nerd-font"
cask "font-sf-mono-nerd-font"
cask "gstreamer-runtime"
cask "iina"
cask "iterm2"
cask "notunes"
cask "openinterminal"
cask "raycast"
cask "rectangle"
cask "swimat"
cask "syntax-highlight"
cask "xquartz"
vscode "ahmadawais.shades-of-purple"
vscode "akhail.darcula-theme-python"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "benjaminbenais.copilot-theme"
vscode "butuzov.acid"
vscode "catppuccin.catppuccin-vsc"
vscode "codezombiech.gitignore"
vscode "cschlosser.doxdocgen"
vscode "daltonmenezes.aura-theme"
vscode "danields761.dracula-theme-from-intellij-pythoned"
vscode "donjayamanne.githistory"
vscode "dracula-theme.theme-dracula"
vscode "drcika.apc-extension"
vscode "eliverlara.andromeda"
vscode "equinusocio.moxer-icons"
vscode "fabiospampinato.vscode-monokai-night"
vscode "garytyler.darcula-pycharm"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "golang.go"
vscode "grapecity.gc-excelviewer"
vscode "gruntfuggly.todo-tree"
vscode "haskell.haskell"
vscode "herogirenomi.dpp"
vscode "jdinhlife.gruvbox"
vscode "jeff-hykin.better-cpp-syntax"
vscode "justusadam.language-haskell"
vscode "kepler0.cpp-recolored"
vscode "kevinrose.vsc-python-indent"
vscode "liviuschera.noctis"
vscode "magicstack.magicpython"
vscode "mechatroner.rainbow-csv"
vscode "monokai.theme-monokai-pro-vscode"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "mvllow.rose-pine"
vscode "naumovs.color-highlight"
vscode "ocamllabs.ocaml-platform"
vscode "pkief.material-icon-theme"
vscode "premparihar.gotestexplorer"
vscode "redhat.java"
vscode "rust-lang.rust-analyzer"
vscode "sainnhe.gruvbox-material"
vscode "sainnhe.sonokai"
vscode "seansassenrath.vscode-theme-superonedark"
vscode "sumneko.lua"
vscode "teabyii.ayu"
vscode "thomaszhang.vscode-gruvbox"
vscode "timonwong.shellcheck"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "usernamehw.errorlens"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "wayou.file-icons-mac"
vscode "xabikos.javascriptsnippets"
vscode "yzane.markdown-pdf"
vscode "zhuangtongfa.material-theme"
