tap "epk/epk"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/command-not-found"
tap "homebrew/services"
tap "teamookla/speedtest"
brew "antidote"
brew "archey"
brew "bat"
brew "gcc"
brew "btop"
brew "clang-format"
brew "cmake"
brew "cmake-docs"
brew "diff-pdf"
brew "difftastic"
brew "duf"
brew "erdtree"
brew "erlang"
brew "eza"
brew "fd"
brew "fontforge"
brew "gh"
brew "ghc"
brew "golangci-lint"
brew "gpatch"
brew "helix"
brew "htop"
brew "hugo"
brew "ipython"
brew "jq"
brew "lf"
brew "libomp", link: true
brew "python@3.9"
brew "llvm@14"
brew "loc"
brew "luarocks"
brew "micro"
brew "ncdu"
brew "neofetch"
brew "neovim"
brew "nmap"
brew "opam"
brew "open-mpi"
brew "openblas"
brew "openjdk@11"
brew "pdfgrep"
brew "peco"
brew "plplot"
brew "postgresql@14"
brew "python@3.10"
brew "ranger"
brew "redis"
brew "ripgrep"
brew "scc"
brew "shellcheck"
brew "starship"
brew "swiftformat"
brew "swiftlint"
brew "terminal-notifier"
brew "tldr"
brew "tmux"
brew "trash"
brew "tree"
brew "ugit"
brew "wget"
brew "z"
brew "zellij"
brew "zig"
brew "zlib"
brew "zsh"
brew "teamookla/speedtest/speedtest"
cask "basictex"
cask "db-browser-for-sqlite"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-fira-mono"
cask "font-fira-mono-nerd-font"
cask "font-jetbrains-mono"
cask "font-martian-mono"
cask "font-sf-mono-nerd-font"
cask "iina"
cask "iterm2"
cask "netbeans"
cask "notunes"
cask "openinterminal"
cask "orbstack"
cask "raycast"
cask "rectangle"
cask "rio"
cask "swimat"
cask "syntax-highlight"
cask "wireshark"
vscode "ahmadawais.shades-of-purple"
vscode "benjaminbenais.copilot-theme"
vscode "butuzov.acid"
vscode "charliermarsh.ruff"
vscode "cschlosser.doxdocgen"
vscode "dracula-theme.theme-dracula"
vscode "EliverLara.andromeda"
vscode "enkia.tokyo-night"
vscode "fabiospampinato.vscode-monokai-night"
vscode "garytyler.darcula-pycharm"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "GitHub.github-vscode-theme"
vscode "golang.go"
vscode "haskell.haskell"
vscode "HeroGirenomi.dpp"
vscode "jdinhlife.gruvbox"
vscode "jeff-hykin.better-cpp-syntax"
vscode "justusadam.language-haskell"
vscode "kepler0.cpp-recolored"
vscode "liviuschera.noctis"
vscode "magicstack.MagicPython"
vscode "monokai.theme-monokai-pro-vscode"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "mvllow.rose-pine"
vscode "naumovs.color-highlight"
vscode "ocamllabs.ocaml-platform"
vscode "PKief.material-icon-theme"
vscode "premparihar.gotestexplorer"
vscode "rust-lang.rust-analyzer"
vscode "sainnhe.gruvbox-material"
vscode "sumneko.lua"
vscode "teabyii.ayu"
vscode "ThomasZhang.vscode-gruvbox"
vscode "timonwong.shellcheck"
vscode "twxs.cmake"
vscode "usernamehw.errorlens"
vscode "vscodevim.vim"
vscode "wayou.file-icons-mac"
vscode "wayou.vscode-todo-highlight"
vscode "xabikos.JavaScriptSnippets"
vscode "zhuangtongfa.material-theme"
